#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/personal-burrt/shared-services/runs/run-eqAvX4Ktmb7N2xFZ

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named
│ "TF_VAR_lambda_dotnet_redis_user_password" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-eqAvX4Ktmb7N2xFZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_replication_group.shared-redis-cluster-group will be created
  + resource "aws_elasticache_replication_group" "shared-redis-cluster-group" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = "true"
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = "true"
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = "disabled"
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Redis cluster for high availability"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = true
      + network_type                   = (known after apply)
      + node_type                      = "cache.t2.micro"
      + num_cache_clusters             = 3
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "default.redis7"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "shared-redis-cluster-group"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "shared-redis-cache-subnet-group"
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = true
      + transit_encryption_mode        = "required"
      + user_group_ids                 = [
          + "shared-redis-user-group-id",
        ]
    }

  # aws_elasticache_subnet_group.shared-redis-cache-subnet-group will be created
  + resource "aws_elasticache_subnet_group" "shared-redis-cache-subnet-group" {
      + arn         = (known after apply)
      + description = "Redis Cache Subnet Group"
      + id          = (known after apply)
      + name        = "shared-redis-cache-subnet-group"
      + subnet_ids  = (known after apply)
      + tags_all    = (known after apply)
      + vpc_id      = (known after apply)
    }

  # aws_elasticache_user.restricted-default-user will be created
  + resource "aws_elasticache_user" "restricted-default-user" {
      + access_string        = "off ~* -@all"
      + arn                  = (known after apply)
      + engine               = "REDIS"
      + id                   = (known after apply)
      + no_password_required = true
      + tags_all             = (known after apply)
      + user_id              = "restricted-default-user"
      + user_name            = "default"

      + authentication_mode (known after apply)
    }

  # aws_elasticache_user.web-api-lambda-user will be created
  + resource "aws_elasticache_user" "web-api-lambda-user" {
      + access_string        = "on ~* -@all +@connection +@fast +@slow +@scripting +@read +@write"
      + arn                  = (known after apply)
      + engine               = "REDIS"
      + id                   = (known after apply)
      + no_password_required = false
      + tags_all             = (known after apply)
      + user_id              = "web-api-lambda-user"
      + user_name            = "web-api-lambda-user"

      + authentication_mode {
          + password_count = (known after apply)
          + passwords      = (sensitive value)
          + type           = "password"
        }
    }

  # aws_elasticache_user_group.shared-redis-user-group will be created
  + resource "aws_elasticache_user_group" "shared-redis-user-group" {
      + arn           = (known after apply)
      + engine        = "REDIS"
      + id            = (known after apply)
      + tags_all      = (known after apply)
      + user_group_id = "shared-redis-user-group-id"
      + user_ids      = [
          + "restricted-default-user",
          + "web-api-lambda-user",
        ]
    }

  # aws_internet_gateway.public-gateway will be created
  + resource "aws_internet_gateway" "public-gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public-routes will be created
  + resource "aws_route_table" "public-routes" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public-route-subnet-1 will be created
  + resource "aws_route_table_association" "public-route-subnet-1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-route-subnet-2 will be created
  + resource "aws_route_table_association" "public-route-subnet-2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ec2-jump-box-ssh-sg will be created
  + resource "aws_security_group" "ec2-jump-box-ssh-sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic and all outbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "143.58.193.53/32",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "ec2-jump-box-ssh-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elasticache-redis-traffic-sg will be created
  + resource "aws_security_group" "elasticache-redis-traffic-sg" {
      + arn                    = (known after apply)
      + description            = "Allow TCP 6379 inbound traffic and all outbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "elasticache-redis-traffic-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lambda-dotnet-web-api-sg will be created
  + resource "aws_security_group" "lambda-dotnet-web-api-sg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTPS inbound traffic and all outbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "lambda-dotnet-web-api-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.main-subnet-private1 will be created
  + resource "aws_subnet" "main-subnet-private1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.main-subnet-private2 will be created
  + resource "aws_subnet" "main-subnet-private2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.main-subnet-public1 will be created
  + resource "aws_subnet" "main-subnet-public1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.main-subnet-public2 will be created
  + resource "aws_subnet" "main-subnet-public2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main-vpc will be created
  + resource "aws_vpc" "main-vpc" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = true
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

  # aws_vpc_endpoint.secrets-manager-vpc-endpoint will be created
  + resource "aws_vpc_endpoint" "secrets-manager-vpc-endpoint" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-2.secretsmanager"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sec-group-lambda-dotnet-web-api = (known after apply)
  + subnet_private_1_id             = (known after apply)
  + subnet_private_2_id             = (known after apply)
  + subnet_public_1_id              = (known after apply)
  + subnet_public_2_id              = (known after apply)
  + vpc_id                          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @burrt, Action: `pull_request`, Working Directory: ``, Workflow: `CI/CD`*